CSI API ETABS v1
cDCoIndian_IS_456_2000.GetPreference Method
 Retrieves the value of a concrete design preference item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetPreference(
	int Item,
	ref double Value
)
Function GetPreference (
	Item As Integer,
	ByRef Value As Double
) As Integer
Dim instance As cDCoIndian_IS_456_2000
Dim Item As Integer
Dim Value As Double
Dim returnValue As Integer
returnValue = instance.GetPreference(Item,
	Value)
int GetPreference(
	int Item,
	double% Value
)
abstract GetPreference :
        Item : int *
        Value : float byref -> int
Parameters
Item
Type: System.Int32
 This is an integer between 1 and 8, inclusive, indicating the preference item considered.
Number of interaction curves
Number of interaction points
Consider minimum eccentricity
Gamma steel
Gamma concrete
Pattern live load factor
Utilization factor limit
Multi-response case design
Value
Type: System.Double
 The value of the considered preference item.
 Number of interaction curves
 Value >= 4 and divisable by 4
 Number of interaction points
 Value >= 5 and odd
 Consider minimum eccentricity
 0 = No
 Any other value = Yes
 Gamma steel
 Value > 0
 Gamma concrete
 Value > 0
 Pattern live load factor
 Value >= 0
 Utilization factor limit
 Value > 0
 Multi-response case design
1 = Envelopes
2 = Step-by step
3 = Last step
4 = Envelopes - All
5 = Step-by step - All
Return Value
Type: Int32
 Returns zero if the item is successfully retrieved; otherwise it returns a nonzero value.
See Also
Reference
cDCoIndian_IS_456_2000 Interface
ETABSv1 Namespace